# Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
# Пример:
# - для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21]

def Fibonacci():
    k = int(input('Введите число: '))
    lst = list(range(k * 2 + 1))
    lst[k] = 0
    lst[k - 1] = -1
    lst[k + 1] = 1
    for i in range(2, k + 1):
	    lst[k + i] = lst[k + i - 1] + lst[k + i - 2]
    for n in range(2, k + 1):
        lst[k - n] = -lst[k + n]
    print(f'Список Фибоначчи числа {k}: {lst}')
Fibonacci()